Documents/Обращение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>Обращение</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Архив</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОбращения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОбращений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОтказа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗамерПричиныОтказа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКонтроля</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Информация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОткудаУзнали</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗамерОткудаПришел</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактыЗаказчика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/Обращение/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Пользователь = ПользователиКлиентСервер.АвторизованныйПользователь();
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Автор = Пользователь;
	КонецЕсли;
	
	ФизЛицо = Пользователь.ФизическоеЛицо;
	ФизЛицоСтрока = ФизЛицо.Фамилия + " " + Лев(ФизЛицо.Имя, 1) + "." + Лев(ФизЛицо.Отчество, 1) + ".";
	ДолжностьФизЛица = ФизЛицо.Должность;
	
	Элементы.Архив.Доступность = ЗначениеЗаполнено(Объект.ПричинаОтказа);
	
КонецПроцедуры

&НаКлиенте
Процедура ПричинаОтказаПриИзменении(Элемент)
	Элементы.Архив.Доступность = ЗначениеЗаполнено(Объект.ПричинаОтказа);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(ТекстПользователя) Тогда
		
		НашТекстОтвета = Формат(ТекущаяДата(), "ДЛФ=DT") + "  (" + ДолжностьФизЛица + ") " + ФизЛицоСтрока + ": "+ ТекстПользователя;
		Объект.Информация = Объект.Информация + Символы.ПС + НашТекстОтвета;
		ТекстПользователя = "";
		
	КонецЕсли;
	
КонецПроцедуры
